if OS.mac?
    # taps
    tap "homebrew/cask"
    tap "homebrew/cask-fonts"

    brew "mas"
    brew "noti"
    brew "trash"

    # Applications
    cask "kitty"
    # cask "istat-menus"
    # cask "choosy"
    # cask "audio-hijack"
    # cask "paw"
    cask "postman"
    cask "vlc"

    # Browsers
    #cask "firefox"

    # Fonts
    cask "font-fira-code"
    cask "font-jetbrains-mono"
    cask "font-cascadia-mono"
    cask "font-3270-nerd-font"

    # macOS App Store
    mas "Xcode", id: 497799835
    # mas "Amphetamine", id: 937984704
elsif OS.linux?
    brew "xclip"
end

tap "homebrew/bundle"
tap "homebrew/core"
tap "schniz/tap"

# packages
brew "ack"
brew "bat"
brew "cloc"
brew "diff-so-fancy"
brew "entr"
brew "exa"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "gnupg"
brew "grep"
brew "highlight"
brew "htop"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "markdown"
brew "neofetch"
brew "neovim"
brew "python"
brew "ripgrep"
brew "schniz/tap/fnm"
brew "shellcheck"
brew "tmux"
brew "tree"
brew "vim"
brew "wdiff"
brew "wget"
brew "z"
brew "zsh"
brew "zplug"
brew "elixir"
brew "pass"
brew "pass-otp"
brew "axel"
brew "helm"
brew "kubernetes-cli"
brew "minikube"
brew "watch"
brew "the_silver_searcher"
brew "git-crypt"
brew "node"
brew "npm"
brew "yarn"
brew "rbenv"
